applications/test/dbsReactiveThermalFoam/SegregatedSteps/gridSensitivityAnalysis/fine2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
134400
(
(0.000141883 -1.50902e-07 0)
(0.000141883 -1.50902e-07 0)
(0.000142653 -1.08738e-07 0)
(0.000142653 -1.08738e-07 0)
(0.000142842 -5.66448e-08 0)
(0.000142842 -5.66448e-08 0)
(0.000142897 -3.25943e-08 0)
(0.000142897 -3.25943e-08 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
160
(
(0.000142279 0 0)
(0.000142279 0 0)
(0.000421469 0 0)
(0.000421469 0 0)
(0.0006935 0 0)
(0.0006935 0 0)
(0.000958373 0 0)
(0.000958373 0 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
